---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternInfo.#ctor(System.String)
source: html/aa17166a-977f-c857-9cf5-6c7c6848ace1.htm
---
# Autodesk.Revit.DB.ExportPatternInfo.#ctor Method

Constructs a new ExportPatternInfo using the destination pattern name as input.

## Syntax (C#)
```csharp
public ExportPatternInfo(
	string destinationPatternName
)
```

## Parameters
- **destinationPatternName** (`System.String`) - The destination pattern name (the name of the pattern in the exported format).

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null